InformationRegisters/ПлановаяСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПлановаяСебестоимость</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ПлановаяСебестоимость/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьФакт(Команда)
	Запись.СуммаФакт = РассчитатьСебестоимость(Запись.Номенклатура,Запись.Период,Запись.Предприятие);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьСебестоимость(ВыбНоменклатура,ВыбПериод,ВыбПредприятие)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетныйОборотыКоличество.КоличествоОборот,
		|	УчетныйОборотыСумма.СуммаОборот
		|ИЗ
		|	РегистрБухгалтерии.Учетный.Обороты(
		|			&ДатаНачала,
		|			&ДатаКонца,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Учетный.ВыпускПродукции),
		|			,
		|			Предприятия = &ВыбПредприятие
		|				И Субконто1 = &ВыбПродукция,
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Учетный.ОсновноеПрво),
		|			) КАК УчетныйОборотыСумма
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Учетный.Обороты(
		|				&ДатаНачала,
		|				&ДатаКонца,
		|				,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Учетный.ГотоваяПродукция),
		|				,
		|				Субконто1 = &ВыбПродукция
		|					И Предприятия = &ВыбПредприятие,
		|				КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Учетный.ВыпускПродукции),
		|				) КАК УчетныйОборотыКоличество
		|		ПО УчетныйОборотыСумма.Субконто1 = УчетныйОборотыКоличество.Субконто1
		|			И УчетныйОборотыСумма.Предприятия = УчетныйОборотыКоличество.Предприятия";

	Запрос.УстановитьПараметр("ВыбПредприятие", ВыбПредприятие);
	Запрос.УстановитьПараметр("ВыбПродукция", ВыбНоменклатура);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ВыбПериод));
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(ВыбПериод));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФактСебестоимость = ?(ВыборкаДетальныеЗаписи.КоличествоОборот = 0,0,ВыборкаДетальныеЗаписи.СуммаОборот/ВыборкаДетальныеЗаписи.КоличествоОборот);
	Иначе
		ФактСебестоимость = 0;
	КонецЕсли;
	Возврат ФактСебестоимость;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если БюджетныйНаСервере.РольДоступнаСервер("Администратор") Тогда
		Элементы.СуммаФакт.Доступность = Истина;
	Иначе
		ГлобальнаяДата = УЧ_Сервер.ДатаГлобальногоЗапрета();
		ДатаЗакрытияУчетПредприятие = УЧ_Сервер.ДатаЛокальногоЗапрета(Запись.Предприятие);
		ДатаЗакрытия = Макс(ГлобальнаяДата,ДатаЗакрытияУчетПредприятие);
		ИсточникДата = Запись.Период;	
		Если ИсточникДата <= ДатаЗакрытия  Тогда
			ЭтаФорма.ТолькоПросмотр = Истина
		КонецЕсли;

		Элементы.СуммаФакт.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ БюджетныйНаСервере.РольДоступнаСервер("Администратор") Тогда
		ГлобальнаяДата = УЧ_Сервер.ДатаГлобальногоЗапрета();
		ДатаЗакрытияУчетПредприятие = УЧ_Сервер.ДатаЛокальногоЗапрета(Запись.Предприятие);
		ДатаЗакрытия = Макс(ГлобальнаяДата,ДатаЗакрытияУчетПредприятие);
		ИсточникДата = Запись.Период;	
		Если ИсточникДата <= ДатаЗакрытия  Тогда
			Сообщить("Нельзя сохранять в закрытом периоде!");
			Отказ = Истина
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
